# FQA1:语句和表达式的区别
# ANS1:语句有关键字，如函数定义；表达式没有关键字

# FAQ2:PYTHON的输入与输出
# ANS2: 输出通过input, 输出通过print

# FAQ3:PYTHON支持的操作符
# ANS3:
#     1、 算数运算符: +、 -、 *、 /、 %、 **
#     2、 比较运算符: >, >=, <, <=, !=, ==
#     3、 关系运算符: and, or, not
#     4、 位运算符： &、|、~、>>、<<
#     5、 核心风格: 通过合理的使用括号来增加代码的可读性

# FAQ4:PYTHON支持的数据类型
# ANS4:
#     标准类型
#     1、 数字：整型、浮点型、复数型、布尔型; 其中浮点型的精确存储问题可以通过decimal模块来解决
#     2、 字符串
#     3、 元组
#     4、 列表
#     5、 字典
#     其他类型
#     1、 None
#     2、 集合
#     3、 类、方法
#     4、 函数，需要先定义，再使用
#     5、 文件对象
#     6、 模块

# FAQ5:流程控制
# ANS5:
#     1、 判断语句：if语句
#     2、 循环语句：for语句、 while语句


# FAQ6:什么是属性
# ANS6:与数据有关的项目，如数据值，函数，方法；属性是通过"点"操作符号进行访问，如obj.x

# FAQ7:PYTHON的异常处理语句
# ANS7:try ... except ...语句
#     try中的代码负责错误检查
#     except：负责异常处理